# pip install pandas

In [13]:
#pip install openpyxl
import pandas as pd

data = pd.read_excel("expense3.xlsx")

df = pd.DataFrame(data)
#sum
print(df["Amount"].sum())
#count
print(df["Date"].count())
#max
print(df["Amount"].max())
#min
print(df["Amount"].min())
#mean
print(df["Amount"].mean())
#median
print(df["Amount"].median())

30149
29
16000
10
1039.6206896551723
257.0

In [25]:
#how to eliminate duplicate values in pandas
import pandas as pd

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)
print(df)

     EEID           Name               Job Title
0  E04105  Theodore Dinh     Technical Architect
1  E01639      Austin Vo             Sr. Analyst
2  E00644   Joshua Gupta  Account Representative
3  E04332    Luke Martin                 Analyst
4  E04533  Easton Bailey                 Manager
5  E00530      Eli Jones                 Manager
6  E03496    Robert Yang             Sr. Analyst
7  E01639      Austin Vo             Sr. Analyst
8  E04332    Luke Martin                 Analyst
9  E04533  Easton Bailey                 Manager

In [38]:
#df.drop_duplicates
import pandas as pd

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)
df = df.drop_duplicates("EEID")
print(df)

#delete rows and columns
df = df.drop("Job Title", axis = 1)
df = df.drop([0,2,4], axis = 0)
print(df)

     EEID           Name               Job Title
0  E04105  Theodore Dinh     Technical Architect
1  E01639      Austin Vo             Sr. Analyst
2  E00644   Joshua Gupta  Account Representative
3  E04332    Luke Martin                 Analyst
4  E04533  Easton Bailey                 Manager
5  E00530      Eli Jones                 Manager
6  E03496    Robert Yang             Sr. Analyst
     EEID         Name
1  E01639    Austin Vo
3  E04332  Luke Martin
5  E00530    Eli Jones
6  E03496  Robert Yang

In [3]:
#Dealing with missing values

import pandas as pd

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)
#dropna will drop all the rows which have Nan values
df = df.dropna()
print(df)

     EEID           Name            Job Title    Salary
0  E04105  Theodore Dinh  Technical Architect   99975.0
3  E04332    Luke Martin              Analyst   41336.0
5  E00530      Eli Jones              Manager  105086.0

In [57]:
import pandas as pd
import numpy as np

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)

df = df.replace(np.nan, 'data not available')
print(df)

     EEID                Name            Job Title              Salary
0  E04105       Theodore Dinh  Technical Architect             99975.0
1  E01639           Austin Vo          Sr. Analyst  data not available
2  E00644        Joshua Gupta   data not available             50994.0
3  E04332         Luke Martin              Analyst             41336.0
4  E04533  data not available              Manager            113527.0
5  E00530           Eli Jones              Manager            105086.0
6  E03496         Robert Yang   data not available             97078.0
7  E01639           Austin Vo          Sr. Analyst  data not available
8  E04332  data not available              Analyst            105086.0
9  E04533       Easton Bailey              Manager  data not available

In [55]:
import pandas as pd
import numpy as np

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)
#Replace on the basis of columns.
df["Salary"] = df["Salary"].replace(np.nan, 50000)
print(df)

     EEID           Name            Job Title    Salary
0  E04105  Theodore Dinh  Technical Architect   99975.0
1  E01639      Austin Vo          Sr. Analyst   50000.0
2  E00644   Joshua Gupta                  NaN   50994.0
3  E04332    Luke Martin              Analyst   41336.0
4  E04533            NaN              Manager  113527.0
5  E00530      Eli Jones              Manager  105086.0
6  E03496    Robert Yang                  NaN   97078.0
7  E01639      Austin Vo          Sr. Analyst   50000.0
8  E04332            NaN              Analyst  105086.0
9  E04533  Easton Bailey              Manager   50000.0

In [7]:
import pandas as pd
import numpy as np

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)
print(df)
print()
print(df.fillna(method = "bfill")) #forward fill #backward fill

     EEID           Name            Job Title    Salary
0  E04105  Theodore Dinh  Technical Architect   99975.0
1  E01639      Austin Vo          Sr. Analyst       NaN
2  E00644   Joshua Gupta                  NaN   50994.0
3  E04332    Luke Martin              Analyst   41336.0
4  E04533            NaN              Manager  113527.0
5  E00530      Eli Jones              Manager  105086.0
6  E03496    Robert Yang                  NaN   97078.0
7  E01639      Austin Vo          Sr. Analyst       NaN
8  E04332            NaN              Analyst  105086.0
9  E04533  Easton Bailey              Manager       NaN

     EEID           Name            Job Title    Salary
0  E04105  Theodore Dinh  Technical Architect   99975.0
1  E01639      Austin Vo          Sr. Analyst   50994.0
2  E00644   Joshua Gupta              Analyst   50994.0
3  E04332    Luke Martin              Analyst   41336.0
4  E04533      Eli Jones              Manager  113527.0
5  E00530      Eli Jones              Manager  105086.0
6  E03496    Robert Yang          Sr. Analyst   97078.0
7  E01639      Austin Vo          Sr. Analyst  105086.0
8  E04332  Easton Bailey              Analyst  105086.0
9  E04533  Easton Bailey              Manager       NaN

In [17]:
import pandas as pd
import numpy as np

data = pd.read_excel("expense4.xlsx", "emp_data")

df = pd.DataFrame(data)
#print(df)

#find the mean of the column using np.nanmean()
a = np.array(df["Salary"])
print(np.nanmean(a)) #87583.14

#fill the average value in the empty values using df.fillna() function
df["Salary"] = df["Salary"].fillna(87583.14)
print(df["Salary"].mean())

87583.14285714286
87583.142

In [35]:
#concat, merge (joins)
import pandas as pd


data1 = pd.read_excel("practice_1.xlsx", 0)
data2 = pd.read_excel("practice_1.xlsx", 3)


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)
#use concat method to add two different dataframes 
df3 = pd.concat([df1["First name"],df1["Salary"],df2["City"]], axis = 1)
print(df3)

  First name  Last Name  Salary EEID
0       ross  tribbiani   20000   E1
1     rachel       bing   40000   E2
2     monica      green   25000   E7
3       joey     geller   60000   E8
4   chandler     buffay   33000   E4
5    phoebe        bing   45000   E5

   Age  Gender       City
0   23    male   new york
1   37  female     london
2   52  female      paris
3   33  female   canberra
4   41   male      sydney
5   67    male  new delhi
6   31  female  hyderabad
  First name   Salary       City
0       ross  20000.0   new york
1     rachel  40000.0     london
2     monica  25000.0      paris
3       joey  60000.0   canberra
4   chandler  33000.0     sydney
5    phoebe   45000.0  new delhi
6        NaN      NaN  hyderabad

In [27]:
#Merge

data1 = pd.read_excel("practice_1.xlsx", 0)
data2 = pd.read_excel("practice_1.xlsx", 1)


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)
print()
#use merge method to add two different dataframes which has one common column
#make sure that when you join these dataframes use a column with unique values. 
print(pd.merge(df1,df2, how = "inner")) #inner means common data

  First name  Last Name  Salary
0       ross  tribbiani   20000
1     rachel       bing   40000
2     monica      green   25000
3       joey     geller   60000
4   chandler     buffay   33000
5    phoebe        bing   45000

  First name  Age  Gender       City
0       ross   23    male   new york
1     rachel   37  female     london
2       joey   33  female   canberra
3   chandler   41   male      sydney
4    phoebe    67    male  new delhi
5    gunther   31    male  hyderabad

  First name  Last Name  Salary  Age  Gender       City
0       ross  tribbiani   20000   23    male   new york
1     rachel       bing   40000   37  female     london
2       joey     geller   60000   33  female   canberra
3   chandler     buffay   33000   41   male      sydney
4    phoebe        bing   45000   67    male  new delhi

In [33]:
data1 = pd.read_excel("practice_1.xlsx", 0)
data2 = pd.read_excel("practice_1.xlsx", 1)


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)
print()
print(pd.merge(df1,df2, how = "left", on = "EEID")) #left means add the data from left and common data from right

  First name  Last Name  Salary EEID
0       ross  tribbiani   20000   E1
1     rachel       bing   40000   E2
2     monica      green   25000   E7
3       joey     geller   60000   E8
4   chandler     buffay   33000   E4
5    phoebe        bing   45000   E5

  First name  Age  Gender       City EEID
0       ross   23    male   new york   E1
1     rachel   37  female     london   E2
2       joey   33  female   canberra   E3
3   chandler   41   male      sydney   E4
4    phoebe    67    male  new delhi   E5
5    gunther   31    male  hyderabad   E6

  First name_x  Last Name  Salary EEID First name_y   Age  Gender       City
0         ross  tribbiani   20000   E1         ross  23.0    male   new york
1       rachel       bing   40000   E2       rachel  37.0  female     london
2       monica      green   25000   E7          NaN   NaN     NaN        NaN
3         joey     geller   60000   E8          NaN   NaN     NaN        NaN
4     chandler     buffay   33000   E4     chandler  41.0   male      sydney
5      phoebe        bing   45000   E5      phoebe   67.0    male  new delhi

In [29]:
data1 = pd.read_excel("practice_1.xlsx", 0)
data2 = pd.read_excel("practice_1.xlsx", 1)


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)
print()
print(pd.merge(df1,df2, how = "right")) #Right means add the data from left and common data from left

  First name  Last Name  Salary
0       ross  tribbiani   20000
1     rachel       bing   40000
2     monica      green   25000
3       joey     geller   60000
4   chandler     buffay   33000
5    phoebe        bing   45000

  First name  Age  Gender       City
0       ross   23    male   new york
1     rachel   37  female     london
2       joey   33  female   canberra
3   chandler   41   male      sydney
4    phoebe    67    male  new delhi
5    gunther   31    male  hyderabad

  First name  Last Name   Salary  Age  Gender       City
0       ross  tribbiani  20000.0   23    male   new york
1     rachel       bing  40000.0   37  female     london
2       joey     geller  60000.0   33  female   canberra
3   chandler     buffay  33000.0   41   male      sydney
4    phoebe        bing  45000.0   67    male  new delhi
5    gunther        NaN      NaN   31    male  hyderabad

In [30]:
data1 = pd.read_excel("practice_1.xlsx", 0)
data2 = pd.read_excel("practice_1.xlsx", 1)


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)
print()
print(pd.merge(df1,df2, how = "outer")) #outer means all the data

  First name  Last Name  Salary
0       ross  tribbiani   20000
1     rachel       bing   40000
2     monica      green   25000
3       joey     geller   60000
4   chandler     buffay   33000
5    phoebe        bing   45000

  First name  Age  Gender       City
0       ross   23    male   new york
1     rachel   37  female     london
2       joey   33  female   canberra
3   chandler   41   male      sydney
4    phoebe    67    male  new delhi
5    gunther   31    male  hyderabad

  First name  Last Name   Salary   Age  Gender       City
0       ross  tribbiani  20000.0  23.0    male   new york
1     rachel       bing  40000.0  37.0  female     london
2     monica      green  25000.0   NaN     NaN        NaN
3       joey     geller  60000.0  33.0  female   canberra
4   chandler     buffay  33000.0  41.0   male      sydney
5    phoebe        bing  45000.0  67.0    male  new delhi
6    gunther        NaN      NaN  31.0    male  hyderabad

In [31]:
data1 = pd.read_excel("practice_1.xlsx", 0)
data2 = pd.read_excel("practice_1.xlsx", 1)


df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)
print()
print(pd.merge(df1,df2, how = "cross")) #cross means one values of df1 with all the values of df2

  First name  Last Name  Salary
0       ross  tribbiani   20000
1     rachel       bing   40000
2     monica      green   25000
3       joey     geller   60000
4   chandler     buffay   33000
5    phoebe        bing   45000

  First name  Age  Gender       City
0       ross   23    male   new york
1     rachel   37  female     london
2       joey   33  female   canberra
3   chandler   41   male      sydney
4    phoebe    67    male  new delhi
5    gunther   31    male  hyderabad

   First name_x  Last Name  Salary First name_y  Age  Gender       City
0          ross  tribbiani   20000         ross   23    male   new york
1          ross  tribbiani   20000       rachel   37  female     london
2          ross  tribbiani   20000         joey   33  female   canberra
3          ross  tribbiani   20000     chandler   41   male      sydney
4          ross  tribbiani   20000      phoebe    67    male  new delhi
5          ross  tribbiani   20000      gunther   31    male  hyderabad
6        rachel       bing   40000         ross   23    male   new york
7        rachel       bing   40000       rachel   37  female     london
8        rachel       bing   40000         joey   33  female   canberra
9        rachel       bing   40000     chandler   41   male      sydney
10       rachel       bing   40000      phoebe    67    male  new delhi
11       rachel       bing   40000      gunther   31    male  hyderabad
12       monica      green   25000         ross   23    male   new york
13       monica      green   25000       rachel   37  female     london
14       monica      green   25000         joey   33  female   canberra
15       monica      green   25000     chandler   41   male      sydney
16       monica      green   25000      phoebe    67    male  new delhi
17       monica      green   25000      gunther   31    male  hyderabad
18         joey     geller   60000         ross   23    male   new york
19         joey     geller   60000       rachel   37  female     london
20         joey     geller   60000         joey   33  female   canberra
21         joey     geller   60000     chandler   41   male      sydney
22         joey     geller   60000      phoebe    67    male  new delhi
23         joey     geller   60000      gunther   31    male  hyderabad
24     chandler     buffay   33000         ross   23    male   new york
25     chandler     buffay   33000       rachel   37  female     london
26     chandler     buffay   33000         joey   33  female   canberra
27     chandler     buffay   33000     chandler   41   male      sydney
28     chandler     buffay   33000      phoebe    67    male  new delhi
29     chandler     buffay   33000      gunther   31    male  hyderabad
30      phoebe        bing   45000         ross   23    male   new york
31      phoebe        bing   45000       rachel   37  female     london
32      phoebe        bing   45000         joey   33  female   canberra
33      phoebe        bing   45000     chandler   41   male      sydney
34      phoebe        bing   45000      phoebe    67    male  new delhi
35      phoebe        bing   45000      gunther   31    male  hyderabad